tap "heroku/brew"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
tap "khaphanspace/gonhanh", trusted: true
tap "libsql/sqld", trusted: true
tap "nikitabobko/tap"
tap "supabase/tap"
tap "tursodatabase/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Core application library for C
brew "glib"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Manage your Java environment
brew "jenv"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Open-source distributed event streaming platform
brew "kafka"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Object-relational database system
brew "postgresql@14"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "tursodatabase/tap/turso", trusted: true
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Menu bar manager
cask "thaw"
# Multiplayer code editor
cask "zed"
uv "specify-cli"
npm "corepack"
npm "typescript-language-server"
npm "typescript"
